sdaiCreateModelBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates a new SDAI model instance.
\param repository [in] A SDAI repository that contains the model.
\param modelName  [in] A string that contains the model name.
\param schemaName [in] A string that contains the schema name.
\returns An identifier of the created model or NULL identifier if operation fails.
\code
SdaiSession session = sdaiOpenSession();
SdaiRep repo = sdaiOpenRepositoryBN(session, "test_repository");
SdaiModel model = sdaiCreateModelBN(repo, "ModelName", "ifc4");